import numpy as np


class Memory(object):

    previous_data = []

    previous_data1 = np.array([[563, 624, 873, 720,  17],
       [536, 624, 845, 720,  16],
       [574, 576, 868, 672,  17],
       [537, 576, 831, 672,  16],
       [585, 528, 865, 624,  17],
       [540, 528, 820, 624,  16],
       [588, 480, 854, 576,  17],
       [549, 480, 814, 576,  16],
       [582, 432, 834, 528,  17],
       [555, 432, 806, 528,  16],
       [574, 400, 813, 464,  16],
       [583, 368, 809, 432,  17],
       [569, 368, 795, 432,  16],
       [593, 336, 807, 400,  17],
       [570, 336, 783, 400,  16],
       [586, 304, 787, 368,  16],
       [590, 272, 781, 336,  16],
       [593, 240, 772, 304,  16],
       [596, 224, 765, 256,  16],
       [600, 208, 759, 240,  16],
       [605, 192, 756, 224,  16],
       [606, 176, 747, 208,  16],
       [611, 160, 744, 192,  16],
       [614, 144, 739, 176,  16],
       [615, 128, 734, 160,  16],
       [617, 112, 728, 144,  16],
       [609,  96, 728, 128,  13],
       [614,  80, 730, 112,   3],
       [617,  64, 726,  96,   3],
       [620,  48, 720,  80,   3],
       [622,  32, 720,  64,   3],
       [624,  16, 715,  48,   3],
       [630,   8, 707,  24,   3],
       [629,   0, 704,  16,   3]])

    overlap = 0.3
    perspective = []
    a_perspective = [[629,   0, 704,  16,   3]]
    b_perspective = [[563, 624, 873, 720, 16]]

    x1_perspective = []
    x2_perspective = []
    box_width = []
    x1 = [550, 554, 554, 559, 563, 568, 574, 577, 580, 583, 586, 589, 593, 595, 596, 598, 599, 601, 602, 604, 605]
    x2 = [879, 867, 867, 855, 843, 831, 815, 807, 799, 791, 783, 775, 763, 759, 755, 751, 747, 743, 739, 735, 731]

    y_lines = [720, 672, 624, 576, 528, 464, 432, 400, 368, 336, 304, 256, 240, 224, 208, 192, 176, 160, 144, 128, 112, 96, 80, 64, 48, 24, 16]
    # проведена ли уже иициализация пути
    current_rails_detected = False
    # начальный инициализированный путь
    init_box_detected = []
    # инициализированные до этого пути
    previous_init_boxes = []

    previous_frame_boxes = []

    current_class = ''
    init_box_waiter = 0
    # предидущий бокс в кадре
    previous_box = []
    # текущие пути в кадре
    current_frame_rails = []

    between_frame_counter = 0
    between_frame_switch_front = 0

    previous_switch = 0
    switch_right_front = 0
    switch_left_front = 0

    right_crossing = 0
    left_crossing = 0
